app/controllers/articles_controller.rb

  def create

    @article = Article.new(article_params)
    @article.user = current_user
    @article.user_id = current_user.id
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "detail", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "s"], ["detail", "s"], ["user_id", 1], ["created_at", 2016-11-29 06:27:05 UTC], ["updated_at", 2016-11-29 06:27:05 UTC]]