app/controllers/comments_controller.rb

  def create
    respond_to do |format|
      if @article.comments.create(comment_params.merge(:user_id => current_user.id))
---
INSERT INTO "comments" ("comment_detail", "article_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_detail", "asdf"], ["article_id", 1], ["user_id", 1], ["created_at", 2016-11-29 06:29:30 UTC], ["updated_at", 2016-11-29 06:29:30 UTC]]